RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_uart.c
    tmpValTxCfg = BL_RD_REG(UARTx, UART_SW_MODE);
    /* Configure rx rts output SW control mode */
    tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_URX_RTS_SW_MODE, uartCfg->rtsSoftwareControl);
    /* Configure tx output SW control mode */
    tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_TXD_SW_MODE, uartCfg->txSoftwareControl);
    BL_WR_REG(UARTx, UART_SW_MODE, tmpValTxCfg);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(UART0_IRQn, UART0_IRQHandler);
    Interrupt_Handler_Register(UART1_IRQn, UART1_IRQHandler);
    Interrupt_Handler_Register(UART2_IRQn, UART2_IRQHandler);
    Interrupt_Handler_Register(UART3_IRQn, UART3_IRQHandler);
#endif
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set default value of all registers function
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_DeInit(UART_ID_Type uartId)
{
    switch(uartId){
        case UART0_ID:
            GLB_AHB_MCU_Software_Reset(GLB_AHB_MCU_SW_UART0);
            break;
        case UART1_ID:
            GLB_AHB_MCU_Software_Reset(GLB_AHB_MCU_SW_UART1);
            break;
        case UART2_ID:
            GLB_AHB_MCU_Software_Reset(GLB_AHB_MCU_SW_UART2);
            break;
        case UART0_MM_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_UART0);
            break;
        default:
            break;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure fifo function
 *
 * @param  uartId: UART ID type
 * @param  fifoCfg: FIFO configuration structure pointer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_FifoConfig(UART_ID_Type uartId, UART_FifoCfg_Type *fifoCfg)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Deal with uart fifo configure register */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_1);
    /* Configure dma tx fifo threshold */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_TX_FIFO_TH, fifoCfg->txFifoDmaThreshold);
    /* Configure dma rx fifo threshold */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_RX_FIFO_TH, fifoCfg->rxFifoDmaThreshold);
    /* Write back */
    BL_WR_REG(UARTx, UART_FIFO_CONFIG_1, tmpVal);

    /* Enable or disable uart fifo dma function */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);

    if (ENABLE == fifoCfg->txFifoDmaEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_DMA_TX_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_DMA_TX_EN);
    }

    if (ENABLE == fifoCfg->rxFifoDmaEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_DMA_RX_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_DMA_RX_EN);
    }

    BL_WR_REG(UARTx, UART_FIFO_CONFIG_0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure infra function
 *
 * @param  uartId: UART ID type
 * @param  irCfg: IR configuration structure pointer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_IrConfig(UART_ID_Type uartId, UART_IrCfg_Type *irCfg)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Configure tx ir mode */
    tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);

    if (ENABLE == irCfg->txIrEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_UTX_IR_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_IR_EN);
    }

    if (ENABLE == irCfg->txIrInverse) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_UTX_IR_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_IR_INV);
    }

    BL_WR_REG(UARTx, UART_UTX_CONFIG, tmpVal);

    /* Configure rx ir mode */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);

    if (ENABLE == irCfg->rxIrEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_URX_IR_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_URX_IR_EN);
    }

    if (ENABLE == irCfg->rxIrInverse) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_URX_IR_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_URX_IR_INV);
    }

    BL_WR_REG(UARTx, UART_URX_CONFIG, tmpVal);

    /* Configure tx ir pulse start and stop position */
    BL_WR_REG(UARTx, UART_UTX_IR_POSITION, irCfg->txIrPulseStop << 0x10 | irCfg->txIrPulseStart);

    /* Configure rx ir pulse start position */
    BL_WR_REG(UARTx, UART_URX_IR_POSITION, irCfg->rxIrPulseStart);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable UART
 *
 * @param  uartId: UART ID type
 * @param  direct: UART direction type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_Enable(UART_ID_Type uartId, UART_Direction_Type direct)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_DIRECTION_TYPE(direct));

    if (direct == UART_TX || direct == UART_TXRX) {
        /* Enable UART tx unit */
        tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);
        BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_UTX_EN));
    }

    if (direct == UART_RX || direct == UART_TXRX) {
        /* Enable UART rx unit */
        tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
        BL_WR_REG(UARTx, UART_URX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_URX_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Disable UART
 *
 * @param  uartId: UART ID type
 * @param  direct: UART direction type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_Disable(UART_ID_Type uartId, UART_Direction_Type direct)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_DIRECTION_TYPE(direct));

    if (direct == UART_TX || direct == UART_TXRX) {
        /* Disable UART tx unit */
        tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);
        BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_EN));
    }

