RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_uart.c
    if (direct == UART_RX || direct == UART_TXRX) {
        /* Disable UART rx unit */
        tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
        BL_WR_REG(UARTx, UART_URX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_URX_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set length of tx data transfer,tx end interrupt will assert when this length is
 *         reached
 *
 * @param  uartId: UART ID type
 * @param  length: Length of data (unit:character/byte)
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetTxDataLength(UART_ID_Type uartId, uint16_t length)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Set length */
    tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);
    BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, UART_CR_UTX_LEN, length - 1));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set length of rx data transfer,rx end interrupt will assert when this length is
 *         reached
 *
 * @param  uartId: UART ID type
 * @param  length: Length of data (unit:character/byte)
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetRxDataLength(UART_ID_Type uartId, uint16_t length)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Set length */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
    BL_WR_REG(UARTx, UART_URX_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, UART_CR_URX_LEN, length - 1));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set rx time-out value for triggering RTO interrupt
 *
 * @param  uartId: UART ID type
 * @param  time: Time-out value (unit:bit time)
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetRxTimeoutValue(UART_ID_Type uartId, uint8_t time)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Set time-out value */
    tmpVal = BL_RD_REG(UARTx, UART_URX_RTO_TIMER);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_CR_URX_RTO_VALUE, time - 1);
    BL_WR_REG(UARTx, UART_URX_RTO_TIMER, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set byte count value for bcr interrupt
 *
 * @param  uartId: UART ID type
 * @param  count: Byte count
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetRxByteCount(UART_ID_Type uartId, uint16_t count)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Set count value */
    tmpVal = BL_RD_REG(UARTx, UART_URX_BCR_INT_CFG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_CR_URX_BCR_VALUE, count);
    BL_WR_REG(UARTx, UART_URX_BCR_INT_CFG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set de-glitch function cycle count value
 *
 * @param  uartId: UART ID type
 * @param  deglitchCnt: De-glitch function cycle count
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetDeglitchCount(UART_ID_Type uartId, uint8_t deglitchCnt)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Set count value */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_CR_URX_DEG_CNT, deglitchCnt);
    BL_WR_REG(UARTx, UART_URX_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set tx and rx baudrate according to auto baudrate detection value
 *
 * @param  uartId: UART ID type
 * @param  autoBaudDet: Choose detection value using codeword 0x55 or start bit
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_ApplyAbrResult(UART_ID_Type uartId, UART_AutoBaudDetection_Type autoBaudDet)
{
    uint32_t UARTx = uartAddr[uartId];
    uint16_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Get detection value */
    tmpVal = UART_GetAutoBaudCount(uartId, autoBaudDet);

    /* Set tx baudrate */
    BL_WR_REG(UARTx, UART_BIT_PRD, tmpVal << 0x10 | tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set rx rts output software control value
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetRtsValue(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Rts set 1*/
    tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
    BL_WR_REG(UARTx, UART_SW_MODE, BL_SET_REG_BIT(tmpVal, UART_CR_URX_RTS_SW_VAL));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART clear rx rts output software control value
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_ClrRtsValue(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Rts clear 0 */
    tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
    BL_WR_REG(UARTx, UART_SW_MODE, BL_CLR_REG_BIT(tmpVal, UART_CR_URX_RTS_SW_VAL));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set tx output software control value
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetTxValue(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Tx set 1*/
    tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
    BL_WR_REG(UARTx, UART_SW_MODE, BL_SET_REG_BIT(tmpVal, UART_CR_UTX_TXD_SW_VAL));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART clear tx output software control value
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_ClrTxValue(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Rts clear 0 */
    tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
    BL_WR_REG(UARTx, UART_SW_MODE, BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_TXD_SW_VAL));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure tx free run mode function
 *
 * @param  uartId: UART ID type
 * @param  txFreeRun: Enable or disable tx free run mode
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_TxFreeRun(UART_ID_Type uartId, BL_Fun_Type txFreeRun)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Enable or disable tx free run mode */
    tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);

    if (ENABLE == txFreeRun) {
        BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_UTX_FRM_EN));
    } else {
        BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_FRM_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure auto baud rate detection function
 *
 * @param  uartId: UART ID type
 * @param  autoBaud: Enable or disable auto function
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_AutoBaudDetection(UART_ID_Type uartId, BL_Fun_Type autoBaud)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

